app/Controllers/Home.php

SELECT *
FROM `subject`
SELECT *
FROM `classes`
SELECT *
FROM `user`
WHERE `user`.`id` = '5'
---
    public function getIndex()
    {

        $classModel = new \App\Models\ClassModel();
        $userModel = new \App\Models\UserModel();
        $subjectModel = new \App\Models\SubjectModel();

        $subjects = $subjectModel->findAll();
        $classes = $classModel->findAll();
        foreach ($subjects as $subject) {
            $tutor_subjects[$subject->name] = $subject->name;
        }
        $data["subjects"] = $subjects;
        foreach ($subjects as $subject) {
            $tutor_subjects[$subject->name] = array();
            foreach ($classes as $sclass) {

                if ($sclass->subject_id == $subject->name && $sclass->occupied == 0 ) {

                    $user = $userModel->find($sclass->tutor_id);