app/Controllers/Search.php

    public function postIndex()
    {
        // Validate and sanitize user input
        $validation = \Config\Services::validation();
        $searchTerm = $this->request->getPost('search', FILTER_SANITIZE_STRING);
        $userModel = new UserModel();
        $subjectModel = new \App\Models\SubjectModel();
        $classModel = new \App\Models\ClassModel();
        $filterdusers = $userModel->like('username', $searchTerm)->findAll();


        $subjects = $subjectModel->findAll();
        $classes = $classModel->findAll();
        foreach ($subjects as $subject) {
            $tutor_subjects[$subject->name] = $subject->name;
        }
        $data["subjects"] = $subjects;
        foreach ($subjects as $subject) {
            $tutor_subjects[$subject->name] = array();
            foreach ($classes as $sclass) {

                if ($sclass->subject_id == $subject->name && $sclass->occupied == 0 ) {

                    $user = $userModel->find($sclass->tutor_id);
---
SELECT *
FROM `user`
WHERE `username` LIKE '%ed%' ESCAPE '!'
SELECT *
FROM `subject`
SELECT *
FROM `classes`
SELECT *
FROM `user`
WHERE `user`.`id` = '5'