app/Controllers/User.php

SELECT *
FROM `user`
WHERE `username` = 'test'
OR `email` = 'test@diego.com'
 LIMIT 1
---
            }
            // Check if the user already exists
            $userModel = new UserModel();
            $existingUser = $userModel->where('username', $data['username'])
                ->orWhere('email', $data['email'])
                ->first();

INSERT INTO `user` (`username`, `email`, `password`, `role`) VALUES ('test', 'test@diego.com', '$2y$10$cW/xC/AfpdZqq/My1/GudevN7EvbqPR2mRVx.TLLQ8jBwbivv7hRG', 'student')
---
            $userModel = new UserModel();

            // Insert the data into the users table
            if ($userModel->insert($data)) {